Австралия/src/Documents/CashReceipt/CashReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CashReceipt</name>
  <basedOn>Document.FixedAssetSale</basedOn>
  <basedOn>Document.SalesInvoice</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.ShiftClosure</basedOn>
  <basedOn>Document.LoanContract</basedOn>
  <basedOn>Document.WorkOrder</basedOn>
  <basedOn>Document.SubcontractorInvoiceIssued</basedOn>
  <registerRecords>AccumulationRegister.CashInCashRegisters</registerRecords>
  <registerRecords>AccumulationRegister.VATOutput</registerRecords>
  <registerRecords>AccumulationRegister.InvoicesAndOrdersPayment</registerRecords>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccumulationRegister.POSSummary</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.AdvanceHolders</registerRecords>
  <registerRecords>AccumulationRegister.PaymentCalendar</registerRecords>
  <registerRecords>AccumulationRegister.ThirdPartyPayments</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesCashMethod</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.AccountsReceivable</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.CashAssets</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.AccountsPayable</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesRetained</registerRecords>
  <registerRecords>AccumulationRegister.LoanSettlements</registerRecords>
  <registerRecords>AccumulationRegister.UnallocatedExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <registerRecords>AccumulationRegister.MiscellaneousPayable</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesCashReceipt</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCash</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>AcceptedFrom</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Basis</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvanceHolder</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.CashVoucher</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Correspondence</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CashCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.FixedAssetSale</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.CashTransferPlan</types>
      <types>DocumentRef.CashInflowForecast</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorInvoiceIssued</types>
      <types>DocumentRef.Quote</types>
      <types>DocumentRef.ShiftClosure</types>
      <types>DocumentRef.LoanContract</types>
      <types>DocumentRef.LoanInterestCommissionAccruals</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>CashCR</name>
    <type>
      <types>CatalogRef.CashRegisters</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesSlipNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountingAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Multiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LoanContract</name>
    <type>
      <types>DocumentRef.LoanContract</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ForOpeningBalancesOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RegisterIncome</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentDetails</name>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.CounterpartyContracts</types>
      </type>
    </attributes>
    <attributes>
      <name>AdvanceFlag</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.FixedAssetSale</types>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.AccountSalesFromConsignee</types>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.DebitNote</types>
        <types>DocumentRef.ExpenseReport</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorInvoiceIssued</types>
        <types>DocumentRef.AccountSalesToConsignor</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.ArApAdjustments</types>
        <types>DocumentRef.PaymentReceipt</types>
        <types>DocumentRef.AdditionalExpenses</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExchangeRate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Order</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
        <types>DocumentRef.PurchaseOrder</types>
        <types>DocumentRef.WorkOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>PlanningDocument</name>
      <type>
        <types>DocumentRef.CashTransferPlan</types>
        <types>DocumentRef.CashInflowForecast</types>
      </type>
    </attributes>
    <attributes>
      <name>TypeOfAmount</name>
      <type>
        <types>EnumRef.LoanScheduleAmountTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>EPDAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsEPDAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExistsEPD</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountsPayableGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>AdvancesPaidGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountsReceivableGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>AdvancesReceivedGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountAllowedGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.CashFlowItems</types>
      </type>
    </attributes>
    <attributes>
      <name>ThirdPartyPayerGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>ThirdPartyCustomer</name>
      <type>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
    <attributes>
      <name>ThirdPartyCustomerContract</name>
      <type>
        <types>CatalogRef.CounterpartyContracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>VATOutputGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountAllowedExpenseItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Enums/OperationTypesCashReceipt/OperationTypesCashReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesCashReceipt</name>
  <enumValues>
    <name>CurrencyPurchase</name>
  </enumValues>
  <enumValues>
    <name>FromAdvanceHolder</name>
  </enumValues>
  <enumValues>
    <name>FromCustomer</name>
  </enumValues>
  <enumValues>
    <name>FromVendor</name>
  </enumValues>
  <enumValues>
    <name>LoanRepaymentByCounterparty</name>
  </enumValues>
  <enumValues>
    <name>LoanRepaymentByEmployee</name>
  </enumValues>
  <enumValues>
    <name>LoanSettlements</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherSettlements</name>
  </enumValues>
  <enumValues>
    <name>RetailIncome</name>
  </enumValues>
  <enumValues>
    <name>RetailIncomeEarningAccounting</name>
  </enumValues>
  <enumValues>
    <name>PaymentFromThirdParties</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/CashReceipt/Forms/ListForm/Module.bsl
#Region EventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
		
	If Parameters.Property("CashIncomeOfRetailRevenue") Then
		
		ValueList = New ValueList;
		ValueList.Add(Enums.OperationTypesCashReceipt.RetailIncome);
		ValueList.Add(Enums.OperationTypesCashReceipt.RetailIncomeEarningAccounting);
		
		DriveClientServer.SetListFilterItem(List,"OperationKind",ValueList,True,DataCompositionComparisonType.InList);
		
		AutoTitle = False;
		Title = "Cash receipt of retail revenue";
	
	EndIf;
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
	// StandardSubsystems.AttachableCommands
	AttachableCommands.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtServer
Procedure OnLoadDataFromSettingsAtServer(Settings)
	
	FilterCompany 		= Settings.Get("FilterCompany");
	PettyCashFilter 				= Settings.Get("PettyCashFilter");
	FilterTypeOperations 		= Settings.Get("FilterTypeOperations"); 
	
	DriveClientServer.SetListFilterItem(List, "Company", FilterCompany, ValueIsFilled(FilterCompany));
	DriveClientServer.SetListFilterItem(List, "PettyCash", PettyCashFilter, ValueIsFilled(PettyCashFilter));
	DriveClientServer.SetListFilterItem(List, "OperationKind", FilterTypeOperations, ValueIsFilled(FilterTypeOperations));
	
EndProcedure

&AtClient
Procedure FilterCompanyOnChange(Item)
	DriveClientServer.SetListFilterItem(List, "Company", FilterCompany, ValueIsFilled(FilterCompany));
EndProcedure

&AtClient
Procedure FilterPettyCashOnChange(Item)
	DriveClientServer.SetListFilterItem(List, "PettyCash", PettyCashFilter, ValueIsFilled(PettyCashFilter));
EndProcedure

&AtClient
Procedure FilterOperationKindOnChange(Item)
	DriveClientServer.SetListFilterItem(List, "OperationKind", FilterTypeOperations, ValueIsFilled(FilterTypeOperations));
EndProcedure

#EndRegion

#Region Internal

#Region LibrariesHandlers

// StandardSubsystems.AttachableCommands
&AtClient
Procedure Attachable_ExecuteCommand(Command)
	AttachableCommandsClient.ExecuteCommand(ThisObject, Command, Items.List);
EndProcedure

&AtServer
Procedure Attachable_ExecuteCommandAtServer(Context, Result)
	AttachableCommands.ExecuteCommand(ThisObject, Context, Items.List, Result);
EndProcedure

&AtClient
Procedure Attachable_UpdateCommands()
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Items.List);
EndProcedure
// End StandardSubsystems.AttachableCommands

#EndRegion

#EndRegion
